# JAFFE

Best model architecture

	Model: "sequential"
    _________________________________________________________________
    Layer (type)                 Output Shape              Param #
    =================================================================
    rescaling (Rescaling)        (None, 48, 48, 1)         0
    _________________________________________________________________
    conv2d (Conv2D)              (None, 48, 48, 32)        320
    _________________________________________________________________
    max_pooling2d (MaxPooling2D) (None, 24, 24, 32)        0
    _________________________________________________________________
    dropout (Dropout)            (None, 24, 24, 32)        0
    _________________________________________________________________
    conv2d_1 (Conv2D)            (None, 24, 24, 64)        18496
    _________________________________________________________________
    max_pooling2d_1 (MaxPooling2 (None, 12, 12, 64)        0
    _________________________________________________________________
    dropout_1 (Dropout)          (None, 12, 12, 64)        0
    _________________________________________________________________
    flatten (Flatten)            (None, 9216)              0
    _________________________________________________________________
    dense (Dense)                (None, 64)                589888
    _________________________________________________________________
    dropout_2 (Dropout)          (None, 64)                0
    _________________________________________________________________
    dense_1 (Dense)              (None, 6)                 390
    _________________________________________________________________
    activation (Activation)      (None, 6)                 0
    =================================================================
    Total params: 609,094
    Trainable params: 609,094
    Non-trainable params: 0
    _________________________________________________________________

Best model hyperparams
    Objective(name='val_sparse_categorical_accuracy', direction='max')
    Trial summary
    Hyperparameters:
        activation1: tanh
        dropout1: 0.30000000000000004
        activation2: relu
        dropout2: 0.30000000000000004
        dense_activation: sigmoid
        dropout3: 0.1
        optimizer: rmsprop
        learning_rate: 0.001
        Score: 0.46621622145175934

# CK+

Best model architecture

    Model: "sequential"
    _________________________________________________________________
    Layer (type)                 Output Shape              Param #
    =================================================================
    rescaling (Rescaling)        (None, 48, 48, 1)         0
    _________________________________________________________________
    conv2d (Conv2D)              (None, 48, 48, 32)        320
    _________________________________________________________________
    max_pooling2d (MaxPooling2D) (None, 24, 24, 32)        0
    _________________________________________________________________
    dropout (Dropout)            (None, 24, 24, 32)        0
    _________________________________________________________________
    conv2d_1 (Conv2D)            (None, 24, 24, 64)        18496
    _________________________________________________________________
    max_pooling2d_1 (MaxPooling2 (None, 12, 12, 64)        0
    _________________________________________________________________
    dropout_1 (Dropout)          (None, 12, 12, 64)        0
    _________________________________________________________________
    flatten (Flatten)            (None, 9216)              0
    _________________________________________________________________
    dense (Dense)                (None, 64)                589888
    _________________________________________________________________
    dropout_2 (Dropout)          (None, 64)                0
    _________________________________________________________________
    dense_1 (Dense)              (None, 6)                 390
    _________________________________________________________________
    activation (Activation)      (None, 6)                 0
    =================================================================
    Total params: 609,094
    Trainable params: 609,094
    Non-trainable params: 0
    _________________________________________________________________

Best model hyperparams
    Objective(name='val_sparse_categorical_accuracy', direction='max')
    Trial summary
    Hyperparameters:
        activation1: tanh
        dropout1: 0.30000000000000004
        activation2: relu
        dropout2: 0.30000000000000004
        dense_activation: sigmoid
        dropout3: 0.1
        optimizer: rmsprop
        learning_rate: 0.001
        Score: 0.9866666793823242


# Summary

jaffe dataset non-mixed data:
	Training accuracy: 0.8401639461517334
	Test loss and accuracy: [0.9271993041038513, 0.6612021923065186]
ck-plus dataset non-mixed data:
	Training accuracy: 0.9784075617790222
	Test loss and accuracy: [0.15941795706748962, 0.9623655676841736]

Asian model using Caucasian data [test loss, test accuracy]: [1.461204171180725, 0.46236559748649597]
Caucasian model using Asian data [test loss, test accuracy]: [2.9688143730163574, 0.25136610865592957]

